{
    "link": "https://www.upwork.com/jobs/Java-Full-Stack-Developer-with-React-and-Security-Payment-Services_~021839592726384326562/?referrer_url_path=/nx/search/jobs/details/~021839592726384326562",
    "posting_job": "Posted 2 hours ago",
    "title_job": "Java Full Stack Developer with React and Security/Payment Services",
    "location": "Worldwide",
    "description": "We are looking for an ambitious, self-driven Full Stack Developer. You will analyze, implement, build, test, document, and support world-class ticketing software. You will work alongside other engineers and designers, collaborating on the various layers of the infrastructure. With your excellent communication skills and willingness to learn, you will take on new challenges. This is a great opportunity to participate in a growing, supportive, and collaborative Agile team while working on all areas of the development stack.\n\nPosition Responsibilities:\nDesign and build new features that deliver a consistent, repeatable, and superior customer experience.\nWrite a clear, concise, readable code that follows common design patterns and principles.\nConsider accessibility, user experience, ethics in design, and quality of data when implementing code.\nUse of profiling tools to monitor performance.\nHelp create and maintain a positive, inclusive, and accepting work environment.\nParticipate in code reviews and provide mentorship to team members.\nMaintain coding standards and practices.\nCollaborate across multiple departments.\nTranslate business requirements into technical design specifications that work well with established architecture.\nCreate and update documentation on the user and technical manuals to reflect UI changes, test plans, and other documentation as needed.\n\n\nRequirements:\n4+ years in various professional Web development environments (which includes co-op or freelance work).\nExperience developing high-volume commercial-grade, web-based enterprise solutions or consumer-facing e-commerce solutions in a similar role.\nProven experience with Java and Spring Boot (4+ years).\nStrong proficiency in React.\nExperience with cloud infrastructure and deployment technologies.\nExperience with payment service integration and security measures.\nProficiency in database management (SQL preferable).\nKnowledge of troubleshooting and debugging practices and techniques.\nCommanding knowledge of UI component life cycles, rendering, and performance.\nExcellent written and verbal communication skills.\nDemonstrable problem-solving skills.\nExperience with internationalization and localization.\n\n\nNice to Have:\nMobile development experience such as React Native, Objective-C, and Ionic is a plus.\nAzure, Azure DevOps, MS SQL Server, IIS, Helm charts, AKS.\nKnowledge of common software vulnerabilities, including OWASP top vulnerability lists, OWASP Web Security Testing Framework.\nWeb Accessibility standards.\nWeb usability scoring, Material Design paradigm, etc.",
    "feature": "More than 30 hrs/week\nHourly\n3 to 6 months\nProject Length\nExpert\nI am willing to pay higher rates for the most experienced freelancers\n$20.00\n-\n$25.00\nHourly",
    "activity": "Activity on this job\nProposals:\n5 to 10\nLast viewed by client:\n10 minutes ago\nInterviewing:\n0\nInvites sent:\n0\nUnanswered invites:\n0",
    "tags": [
        "React",
        "Java",
        "JavaScript"
    ],
    "client": {
        "location": "Ukraine\nTernopil 2:24 PM",
        "count_posted_jobs": "0% hire rate, 1 open job",
        "total_spent": null,
        "hourly_rate": null,
        "rating": null
    },
    "time_parsing": 1727436299
}