{
    "link": "https://www.upwork.com/jobs/Python-Backend-Developer_~021839622757895047068/?referrer_url_path=/nx/search/jobs/details/~021839622757895047068",
    "posting_job": "Posted 16 minutes ago",
    "title_job": "Python Backend Developer",
    "location": "Worldwide",
    "description": "Please read all of the below before responding.\nRespond with full CV out lining that you cover ALL of the required skills. You must have activeliy worked with the required skills to be shortlisted. Anyone not fullfilling ALL required skills and at least one prefereed skill will be disregarded.\nAn email saying you are interested or you are good for the job will be disregarded.\n\nOnly full CVs and a short letter on how you fullfill what is asked for by my client.\n\nWe are now looking for a Python Backend Developer on the behalf of our client.\n\n\nJob Description:\nWe are looking for an experienced Python Backend Developer with a robust understanding of Azure cloud services, microservices architecture and automation. ShotGrid Autodesk integration will be considered a strong advantage. The ideal candidate will be possess experience with CI/CD deployments and Azure DevOps for project management. Familiarity with the ShotGrid platform and its integration into backend services will be regarded as a strong asset. We’re looking for a high-energy developer with a positive attitude to join our dynamic and active team.\n\n\nKey Responsibilities:\nDesign, develop, and maintain scalable and efficient backend services using Python.Utilize Azure cloud services to deploy, manage, and scale applications, ensuring consistent performance across different environments.Implement microservices architecture to enable modular and maintainable systems.Utilize Docker to create, deploy, and manage containerized applications, ensuring consistency and reliability.Implement CI/CD pipelines for automated build, test, and deployment processes, contributing to improved development efficiency and product quality.Integrate ShotGrid Autodesk into backend workflows to enhance project tracking and collaboration.Collaborate closely with cross-functional teams, including frontend developers, pipeline developers, DevOps engineers, and project managers, to deliver high-quality solutions on time.\n\n\nRequired Skills:\nExtensive knowledge and hands-on experience with Python and backend development frameworks.Familiarity with Azure cloud services, including Azure Functions, CosmosDB, and Azure Service Bus.Comprehensive understanding of microservices architecture and principles.Familiarity with CI/CD tools and processes, such as Jenkins, GitHub Actions, or similar platforms.\n\n\nPreferred Skills:\nExperience with ShotGrid Autodesk and its integration into backend systems.A strong passion for automation and process improvement.Proficiency in Docker containers, including creating, deploying, and managing containerized applications using Docker CLI and Docker Compose.\n\n\nEducation and Experience:\nBachelor’s degree in Computer Science, Engineering, or a related.4+ years of professional experience in frontend development.",
    "feature": "More than 30 hrs/week\nHourly\nMore than 6 months\nProject Length\nExpert\nI am willing to pay higher rates for the most experienced freelancers\n$15.00\n-\n$35.00\nHourly",
    "activity": "Activity on this job\nProposals:\n20 to 50\nLast viewed by client:\n1 minute ago\nInterviewing:\n2\nInvites sent:\n9\nUnanswered invites:\n7",
    "tags": [
        "Python",
        "Jenkins",
        "Azure cloud",
        "CosmosDB",
        "microservices architecture",
        "CI/CD",
        "ShotGrid",
        "Docker containers"
    ],
    "client": {
        "location": "United Kingdom\nBrighton 11:23 AM",
        "count_posted_jobs": "24 jobs posted\n67% hire rate, 1 open job",
        "total_spent": "$37K total spent",
        "hourly_rate": "$5.13 /hr avg hourly rate paid",
        "rating": "5.0"
    },
    "time_parsing": 1727436231
}