{
    "link": "https://www.upwork.com/jobs/NetSuite-Consultant-for-ONSITE-FULL-Time-Permanent-with-client_~021839563307227422580/?referrer_url_path=/nx/search/jobs/details/~021839563307227422580",
    "posting_job": "Posted 4 hours ago",
    "title_job": "NetSuite Consultant for ONSITE (FULL-Time Permanent with client)",
    "location": "Worldwide",
    "description": "Imp :\n\n\n\nLocation is Pan india location & its full-time (permanent opportunity).\n\nPlease let us know which location is suitable for you and also please check for suitable JDs as per your skillset as below :\n\n\n\nJD for NetSuite Data Migration Consultant :\n\n\n\nDescription : We are looking for a highly skilled NetSuite Data Migration Lead Consultant with a strong background in NetSuite ERP and accounting.\n\nResponsibilities\n\nLead the end to end migration process from various legacy system to NetSuite.\n\nAnalize existing data structures and develop migration strategies and plans.\n\nDesign and Implement data mapping, transformation, and validate rules to ensure data quality and integrity.\n\nCollaborate with stakeholders to understand business requirements and translate them into technical data migration specification.\n\nCreate and execute test plan to validate data migration processes and outcomes.\n\nDevelop and maintain documentation related to data migration processes, procedure and configurations.\n\nStrong accounting knowledge with experience in bank reconciliation and accounts payable.\n\nWork closely with offshore and onsite team members to report on progress, escalate issue and manage expectation effectively .\n\nCertification in Netsuite or relevant accounting qualifications is a plus.\n\n\n\nNetSuite Techno Functional Consultant with Suite Commerce :\n\n\n\nWe are looking for skilled NetSuite Techno-Functional Consultant with expertise in Suite Commerce InStore to join our team. The candidate should have a deep understanding of NetSuite, SuiteCommerce, and the ability to bridge the gap between business requirements and technical implementation.\n\nResponsibilities:\n\nNetSuite Configuration: Configure and customize NetSuite to meet business requirements, ensuring seamless integration with SuiteCommerce InStore.\n\nSuiteCommerce InStore Implementation: Lead and manage the implementation of SuiteCommerce InStore, including customizations and enhancements to meet the company's e-commerce needs.\n\nFunctional Expertise: Understand and document business processes and requirements. Translate these requirements into NetSuite and SuiteCommerce configurations.\n\nTechnical Expertise: Collaborate with developers and IT teams to provide technical guidance and support in developing custom scripts, workflows, and integrations.\n\nQuality Assurance: Conduct rigorous testing of NetSuite and SuiteCommerce InStore solutions to ensure they meet quality and performance standards.\n\nTraining and Support: Provide training and support to end-users and team members to ensure they can effectively use the NetSuite and SuiteCommerce InStore systems.\n\nDocumentation: Create and maintain documentation for configurations, customizations, and best practices.\n\nStay Current: Keep up-to-date with the latest NetSuite and SuiteCommerce features and updates, and make recommendations for their implementation\n\nCertification in Netsuite or relevant qualifications is a plus.\n\n\n\nNetsuite Integration Lead :\n\n\n\n8+ years of experience implementing and customizing NetSuite ERP solutions.\n\nStrong understanding of NetSuite data model, business processes, and functionality.\n\nProficiency in SuiteScript, SuiteFlow, SuiteTalk, and SuiteBuilder.\n\nDevelopment experience with Client Side / Server-Side\n\nExperience with SuiteCommerce Advanced and SuiteCloud development is a plus.\n\nExcellent analytical and problem-solving skills.\n\nMinimum 2 projects on NetSuite implementation covering Enable features, Web Services integration, Data migration (CSV import & export), Add XML, HTML, CSS, SQL.\n\nStrong communication and interpersonal skills, with the ability to interact effectively with clients and team members.\n\nNetSuite certification(s) preferred.\n\n\n\nNetsuite P2P (Procure-Pay) functional consultant :\n\n\n\nProven experience as a NetSuite functional Lead , including full lifecycle implementations.\n\nExpertise in implementing and supporting the Netsuite ERP application for customers\n\nMinimum 5 years of relevant experience in NetSuite ERP as Functional consultant\n\nExcellent Functional understanding of O2C, P2P , R2R and ARM flows\n\nEngage with client business users to capture requirements, write functional design, process design, configuration, testing, training and cutover\n\nExcellent communication skills\n\nPossess strong analytical and problem solving skills and the willingness to take on stretch assignments to meet critical deadlines and exceed management and client expectations.\n\nAbility to work in a dynamic fastpaced environment with ambiguous situations; must be extremely flexible and have a strong aptitude to manage competing priorities and ensure critical followup of initiatives\n\nProficient in the use of desktop tools and software for presentations, consolidation of data and process mapping, e., MS PowerPoint, Word, Excel, and Visio. JIRA experience is a plus.\n\n\n\nJD for Process Lead :\n\n\n\nRequirements:\n\nMinimum of 8 years of specific NetSuite experience is essential, although other relevant experience\n\nDetermine appropriate forecasting of Project Management and delivery scope to help ensure a successful client experience.\n\nCreate and maintain project documents, including project plans, solution approaches, functional and technical requirements and specifications and can present them to clients.\n\nHands-on experience with NetSuite Project Module,O2C,P2P, R2R, Suite Commerce, Advanced Revenue Module (ARM), including item catalog structure and management, general record structures, scripting, and REST\n\nStrong fluency in NetSuite platform functionality and toolsets\n\nIntegration Experience using Middleware and Direct Integration.\n\nProven experience in delivering software products from design through deployment and production support\n\nBackground in JavaScript, SuiteScript, SuiteBundler, SuiteTalk\n\nIn-depth understanding of the NetSuite data model and data migration approaches\n\nExperience in configuring NetSuite and developing complex scripts (SuiteBuilder, SuiteFlow)\n\nSolid grasp of Object-Oriented Programming (OOP), Object-Oriented Design (OOD), and design patterns\n\nAbility to understand and transform business requirements into technical architecture\n\nExperience with Continuous Integration / Continuous Deployment (CI/CD) tools\n\nContinue to increase product knowledge and pursue relevant certifications.\n\n\n\nNetSuite Technical - Suite Commerce Developer :\n\n\n\n• At least 3+ years of experience in Suite Commerce Advanced Development.\n\n• Analyse complex business requirements and map business processes to Suite Commerce.\n\n• Initial account setups, configurations, bundle installation to enable Suite Commerce on the NetSuite account.\n\n• Creative Experience in developing and deploying Suite Scripts by using Client Scripts, User Event, Suitelets.\n\n• UI/UX implementation throughout the website.\n\n• Customization of customer registration form where NetSuite online form is used to create leads instead of the native one provided by Suite Commerce.\n\n• Created a number of landing pages with good UI.\n\n• Assist in performing fit/gap analysis on business requirements route to system design and execution.\n\n• Develop wire-frame and schematic diagrams to support customer requirements gathering.\n\n• Facilitate end user testing, acceptance, training, and adoption of newly implemented systems and processes.\n\n• Collaborate and work closely with in-house development team to implement custom solutions.\n\n• Expertise in NetSuite ERP module.",
    "feature": "More than 30 hrs/week\nHourly\nMore than 6 months\nProject Length\nExpert\nI am willing to pay higher rates for the most experienced freelancers",
    "activity": "Activity on this job\nProposals:\nLess than 5\nInterviewing:\n0\nInvites sent:\n0\nUnanswered invites:\n0",
    "tags": [
        "NetSuite Development",
        "NetSuite Administration"
    ],
    "client": {
        "location": "India\nPune 4:56 PM",
        "count_posted_jobs": "454 jobs posted\n4% hire rate, 6 open jobs",
        "total_spent": "$4K total spent",
        "hourly_rate": "$17.63 /hr avg hourly rate paid",
        "rating": "4.5"
    },
    "time_parsing": 1727436404
}