{
    "link": "https://www.upwork.com/jobs/MuleSoft-Architect-More-than-Hrs-week_~021839602172269044060/?referrer_url_path=/nx/search/jobs/details/~021839602172269044060",
    "posting_job": "Posted 1 hour ago",
    "title_job": "MuleSoft Architect - More than 30 Hrs a week",
    "location": "Worldwide",
    "description": "We are urgently looking for an experienced MuleSoft Certified Sr Developer/Architect with 8-10+ years of overall experience for someone who is available urgently within 1-2 weeks. Working from Home.\nKey Responsibilities:\n1. Expert level experience with REST web service RAML Swagger open API development and SOA APIs ensuring MuleSoft best practices\n2. Designing architectural concepts for Integration implementations including patterns, encryption, security, logging, throttling, scalability and clustering\n3. Designing, prototyping, and delivering APIs, integration and applications in varied deployment models (cloud-based, on-premise or hybrid), to respond to client needs for cost-efficiency, competitive offering, and agility to respond to new business opportunities.\n4. Provide architecture, analysis, build, and testing for MuleSoft integrations.\n5. Overlook technical delivery for MuleSoft and API Management integration projects and teams.\n6. Understand and validate solution architecture & integration requirements.\n7. Design robust APIs on MuleSoft platform & Business Process Orchestrations - Itinerary using Mule ESB\n9. Design, develop, configure and deploy the solution using modern DevOps tools, continues automation\n10. Serving as an API and integration evangelist, acting as a trusted advisor in guiding all sizes towards the realization of the business outcome by leveraging the application of an API-led strategy using MuleSoft technology.\n11. Document design decisions and integrations resulting from new designs, system changes, or upgrades.\n12. Participate in SIT, end to end, and unit testing efforts in cooperation with overall Testing coordinator.\n13. Strong MuleSoft Cloudhub experience with wider understanding of other technology platforms\n\nRequired Candidate profile\n1. The successful candidate will be able to demonstrate the following skills and experience, certification.\n2. Java and Spring integration experience.\n3. Architecture and development experience in integrations/API space\n4. Strong client facing ability with excellent communication and interpersonal skills.\n5. MuleSoft Certified Developer can be considered for Mulesoft Architect\n6. Any of the below certification will be a plus:\nMuleSoft Certified Platform Architect\nMuleSoft Certified Developer - Level 1 (Mule 4)\nMuleSoft Certified Developer - Level 1 (Mule 4) DELTA\nMuleSoft Certified Developer - Integration and API Associate (Mule 3)\nMuleSoft Certified Developer - API Design Associate (RAML 1.0)\nWe are looking for a true problem solver and team leader who can help us build a strong engineering team!",
    "feature": "More than 30 hrs/week\nHourly\nMore than 6 months\nProject Length\nIntermediate\nI am looking for a mix of experience and value\n$20.00\n-\n$35.00\nHourly\nContract-to-hire\nThis job has the potential to turn into a full time role",
    "activity": "Activity on this job\nProposals:\n5 to 10\nInterviewing:\n0\nInvites sent:\n0\nUnanswered invites:\n0",
    "tags": [
        "API",
        "Mulesoft",
        "RESTful API"
    ],
    "client": {
        "location": "United Kingdom\nLondon 12:24 PM",
        "count_posted_jobs": "55 jobs posted\n10% hire rate, 2 open jobs",
        "total_spent": "$1.8K total spent",
        "hourly_rate": "$23.66 /hr avg hourly rate paid",
        "rating": "4.4"
    },
    "time_parsing": 1727436280
}