{
    "link": "https://www.upwork.com/jobs/Integration-Architect-Solution-Architect_~021839463132616439714/?referrer_url_path=/nx/search/jobs/details/~021839463132616439714",
    "posting_job": "Posted 10 hours ago",
    "title_job": "Integration Architect/ Solution Architect",
    "location": "Worldwide",
    "description": "We are seeking a highly skilled System Integration Expert/Integration Architect to join our team. The ideal candidate will have expertise in system integrations, API development, and strong experience with ALTOVA tools. You will be responsible for designing and implementing scalable integration solutions, defining architectural considerations, and ensuring seamless communication between various systems. This role requires proficiency in .NET, C#, and a deep understanding of integration patterns and testing methodologies.\n\nKey Responsibilities:\n\n- Design and Architect Integration Solutions:\n- Collaborate with stakeholders to understand system requirements and translate them into robust integration architectures.\n- Define integration strategies, including API development and data mapping, to ensure seamless communication between systems.\n- Utilize ALTOVA Tools:\n- Leverage expertise in ALTOVA MapForce and ALTOVA XMLSpy to design, develop, and manage data transformations and integration flows.\n- Perform data mapping and schema validations using - ALTOVA for efficient system integrations.\n- API Development & Management:\nDevelop, implement, and maintain APIs using .NET and C# for system-to-system communication.\nExperience in front end development with ANGULAR will be a huge plus.\nDefine and document API requirements, ensuring adherence to best practices for scalability and security.\nIntegration Requirements & Testing:\nGather and document integration requirements from various stakeholders.\nDefine and execute integration test plans, ensuring that all systems communicate effectively and function as expected.\nPerform unit testing, integration testing, and performance testing to ensure the robustness of integration solutions.\nArchitectural Considerations:\nProvide guidance on architectural design patterns and ensure solutions are scalable, secure, and maintainable.\nEvaluate integration architectures for long-term viability, scalability, and performance optimization.\nCollaboration & Leadership:\nWork closely with development teams, product managers, and external vendors to ensure timely and successful system integrations.\nOffer technical leadership and mentorship on integration practices and architecture.\nTroubleshooting and Optimization:\nTroubleshoot integration-related issues and optimize existing integrations for better performance and efficiency.\nProvide ongoing support and refinement of integration processes as new system updates and features are introduced.\nMust have experience in development (Front end and Backend)\nKey Qualifications:\nBachelor’s degree in Computer Science, Information Technology, or a related field.\nProven experience in system integration, API development, and working with ALTOVA tools (MapForce, XMLSpy, etc.).\nProficiency in .NET, C# and solid understanding of REST/SOAP API design.\nExperience in designing scalable integration architectures and defining integration patterns.\nStrong knowledge of data mapping, ETL, and data transformation processes.\nExpertise in testing methodologies (unit testing, integration testing, etc.) and quality assurance practices.\nUnderstanding of security and scalability considerations in system integration projects.\nExcellent problem-solving skills and attention to detail.\nStrong communication skills with the ability to work collaboratively across multiple teams and stakeholders.\nPreferred Skills:\nExperience with cloud-based integrations (Azure, AWS) is a plus.\nFamiliarity with message queues (e.g., RabbitMQ, Kafka) and microservices architecture.\nKnowledge of CI/CD pipelines and DevOps practices for integration deployment.\nIntegration with ALTOVA\nKnowledge of .NET Core & C# is must\nNOTE - THIS IS AN IMMEDIATE OPENING AND EXPECTED JOIN URGENTLY",
    "feature": "More than 30 hrs/week\nHourly\nMore than 6 months\nProject Length\nExpert\nI am willing to pay higher rates for the most experienced freelancers",
    "activity": "Activity on this job\nProposals:\n10 to 15\nLast viewed by client:\n4 hours ago\nInterviewing:\n3\nInvites sent:\n0\nUnanswered invites:\n0",
    "tags": [
        "Solution Architecture",
        "Software Architecture & Design",
        "altova",
        "Dot net",
        "C#"
    ],
    "client": {
        "location": "United States\nCoral Springs 8:28 AM",
        "count_posted_jobs": "123 jobs posted\n83% hire rate, 1 open job",
        "total_spent": "$1.8M total spent",
        "hourly_rate": "$13.52 /hr avg hourly rate paid",
        "rating": "4.7"
    },
    "time_parsing": 1727436498
}