{
    "link": "https://www.upwork.com/jobs/Senior-Backend-Developer-Node_~021839556037024659362/?referrer_url_path=/nx/search/jobs/details/~021839556037024659362",
    "posting_job": "Posted 4 hours ago",
    "title_job": "Senior Backend Developer (Node.js)",
    "location": "Worldwide",
    "description": "Overview:\n\nWe are looking for a highly experienced Senior Backend Developer with a minimum of 8 years of experience in Node.js to manage the backend of our mobile application that is live and maintain and enhance the admin panel. The ideal candidate will be responsible for ensuring the backend infrastructure is scalable, efficient, and secure, while also collaborating closely with front-end and mobile teams to ensure smooth integration and feature implementation.\n\nKey Responsibilities:\n- Maintain and enhance the existing backend services built on Node.js, ensuring performance, scalability, and security for both mobile applications and the admin panel.\n- Create a Postman collection of existing solution and maintain it for the future.\n- Develop new features and APIs to support the product roadmap and user requirements, ensuring seamless integration with mobile and web platforms.\n- Collaborate with mobile app developers to ensure the backend effectively supports mobile functionality (react native), including user authentication, data synchronization, and third-party integrations.\n- Maintain and improve the admin panel, both frontend and backend, adding new features and functionalities to enhance usability and support business operations.\n- Optimize database queries and ensure the efficient handling of large datasets.\n- Troubleshoot and resolve backend issues quickly and efficiently to ensure minimal downtime for users and administrators.\n- Implement best practices for code quality, performance, and security in all backend services.\n- Ensure proper documentation of all backend processes, APIs, and functionalities.\n- Participate in code reviews and mentor junior developers as needed.\n- Stay updated with the latest Node.js technologies and backend development trends to continuously improve the backend infrastructure.\n\nQualifications:\n- 8+ years of experience in backend development with a strong focus on Node.js.\n- Proven experience working with APIs and microservices architecture for mobile applications and admin panels.\n- Strong understanding of RESTful APIs, including design, implementation, and security best practices.\n- Experience with database technologies (MongoDB) and Heroku and optimization for performance and scalability.\n- Familiarity with authentication mechanisms, including OAuth, JWT, and session management.\n- Experience working with cloud platforms (e.g., AWS, Google Cloud) for backend services deployment.\n- Strong problem-solving skills and the ability to debug and troubleshoot complex issues.\n- Ability to collaborate effectively with cross-functional teams, including front-end, mobile, and DevOps teams.\n- Excellent experience in creating additional environments such as DEV, UAT, and STAGING.\n- Excellent communication skills, both written and verbal, to ensure smooth coordination with teams and stakeholders.\n- Experienced with version control (e.g., Git) and Agile development methodologies.\n\nNice to Have:\n- Experience with CI/CD pipelines for automated testing and deployment.\n- Familiarity with containerization technologies like Docker.\n- Experience with serverless architectures and deployment strategies.\n- Knowledge of performance monitoring tools and load testing for backend services.\n\nWhat We Offer:\n- The opportunity to take ownership of a critical backend infrastructure that supports mobile applications and admin functions.\n- A collaborative, results-oriented work environment with opportunities for professional growth.\n- Flexible remote working options however, the working availability must be in KSA Timezone and the ability to attend video call meetings during this time.\n- The chance to work on exciting new features and contribute to the overall success of the platform.\n\nIf you are a seasoned Node.js backend developer looking to take on a challenging and rewarding role, we would love to hear from you!",
    "feature": "More than 30 hrs/week\nHourly\n3 to 6 months\nProject Length\nIntermediate\nI am looking for a mix of experience and value\n$20.00\n-\n$25.00\nHourly",
    "activity": "Activity on this job\nProposals:\n50+\nLast viewed by client:\n2 hours ago\nInterviewing:\n0\nInvites sent:\n0\nUnanswered invites:\n0",
    "tags": [
        "Node.js",
        "RESTful API",
        "MongoDB"
    ],
    "client": {
        "location": "Saudi Arabia\nRiyadh 2:27 PM",
        "count_posted_jobs": "6 jobs posted\n84% hire rate, 5 open jobs",
        "total_spent": "$2.7K total spent",
        "hourly_rate": "$59.99 /hr avg hourly rate paid",
        "rating": "5.0"
    },
    "time_parsing": 1727436424
}