{
    "link": "https://www.upwork.com/jobs/Great-Plains-Dynamics-Business-Central-Data-Migration-Specialist_~021839468250282139045/?referrer_url_path=/nx/search/jobs/details/~021839468250282139045",
    "posting_job": "Posted 10 hours ago",
    "title_job": "Great Plains to Dynamics Business Central Data Migration Specialist",
    "location": "Worldwide",
    "description": "We are seeking an experienced specialist with expertise in both Great Plains (GP) and Dynamics Business Central (BC) to assist with the migration of data, including all open transactions, from GP to BC.  This will initially be conducted in a test environment using a clone of the production GP server and a sandbox instance of BC.\nHaving experience in designing or recommending a Chart of Accounts structure that works well in BC would be an advantage as the current COA design in GP is not ideal.\nThe ideal candidate will have a strong understanding of both platforms and proven experience in finance data migration projects. Your role will involve ensuring data integrity, mapping fields correctly, and troubleshooting any potential issues during the migration process. If you have a track record of successful migrations and a keen eye for detail, we want to hear from you!",
    "feature": "Less than 30 hrs/week\nHourly\nLess than 1 month\nProject Length\nExpert\nI am willing to pay higher rates for the most experienced freelancers\n$25.00\n-\n$50.00\nHourly",
    "activity": "Activity on this job\nProposals:\n5 to 10\nLast viewed by client:\n5 hours ago\nInterviewing:\n0\nInvites sent:\n1\nUnanswered invites:\n1",
    "tags": [
        "SQL",
        "Dynamics Great Plains",
        "Dynaminc Business Central on-premise",
        "Database"
    ],
    "client": {
        "location": "Australia\nBrisbane 9:28 PM",
        "count_posted_jobs": "1 job posted\n0% hire rate, 1 open job",
        "total_spent": null,
        "hourly_rate": null,
        "rating": null
    },
    "time_parsing": 1727436494
}