{
    "link": "https://www.upwork.com/jobs/Looking-for-blazor-syncfusion-expert_~021839567086780135330/?referrer_url_path=/nx/search/jobs/details/~021839567086780135330",
    "posting_job": "Posted 4 hours ago",
    "title_job": "Looking for blazor & syncfusion expert",
    "location": "Worldwide",
    "description": "We are looking for a highly skilled and experienced .NET Core Developer to join our team for a long-term engagement. The ideal candidate should have extensive expertise in .NET Core, dependency injection, design patterns, Blazor, Syncfusion, and Azure. This position involves handling complex systems and requires a high level of proficiency in the mentioned technologies. Please do not apply if you do not meet the mandatory requirements.\n\n**Responsibilities:**\n- Develop and maintain complex .NET Core applications.\n- Implement dependency injection and design patterns to enhance code quality and maintainability.\n- Design and develop Blazor components and applications.\n- Integrate and utilize Syncfusion controls within Blazor applications.\n- Develop and deploy applications on Azure, leveraging various Azure services.\n- Collaborate with cross-functional teams to gather and analyze requirements.\n- Participate in code reviews and ensure adherence to best practices and coding standards.\n- Troubleshoot and resolve technical issues in a timely manner.\n- Continuously learn and stay updated with the latest industry trends and technologies.\n\n**Requirements:**\n- Expert in .NET Core and C#.\n- Proficient in implementing dependency injection and design patterns.\n- Extensive experience with Blazor (Mandatory).\n- Strong knowledge and hands-on experience with Syncfusion (Mandatory).\n- Experience with Azure services and cloud-based application development.\n- Demonstrated ability to handle complex systems and architecture.\n- Excellent problem-solving skills and attention to detail.\n- Strong communication skills and ability to work in a team.\n- Bachelor's degree in Computer Science, Information Technology, or a related field.\n\n**Preferred Qualifications:**\n- Experience with other front-end technologies and frameworks.\n- Knowledge of DevOps practices and CI/CD pipelines.\n- Familiarity with Agile/Scrum methodologies.\n\n\nIf you are an expert in .NET Core, dependency injection, design patterns, Blazor, Syncfusion, and Azure, we would love to hear from you. Please share detailed information about the work you have done with the same tech stack, including specific projects and your role in them. Be prepared for a technical interview to assess your skills and experience.",
    "feature": "More than 30 hrs/week\nHourly\nMore than 6 months\nProject Length\nExpert\nI am willing to pay higher rates for the most experienced freelancers\n$10.00\n-\n$15.00\nHourly",
    "activity": "Activity on this job\nProposals:\n20 to 50\nLast viewed by client:\n2 hours ago\nInterviewing:\n3\nInvites sent:\n0\nUnanswered invites:\n0",
    "tags": [
        "C#",
        "Syncfusion",
        "Blazor",
        ".NET Core"
    ],
    "client": {
        "location": "United States\nSheridan 7:26 AM",
        "count_posted_jobs": "94 jobs posted\n60% hire rate, 2 open jobs",
        "total_spent": "$31K total spent",
        "hourly_rate": "$14.46 /hr avg hourly rate paid",
        "rating": "4.9"
    },
    "time_parsing": 1727436399
}